zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DSPI_MSC.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2022 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K39_DSPI_MSC.h
 * @version 1.7
 * @date 2022-11-18
 * @brief Peripheral Access Layer for S32K39_DSPI_MSC
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K39_DSPI_MSC_H_)  /* Check if memory map has not been already included */
#define S32K39_DSPI_MSC_H_

#include "S32K39_COMMON.h"

/* ----------------------------------------------------------------------------
   -- DSPI_MSC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DSPI_MSC_Peripheral_Access_Layer DSPI_MSC Peripheral Access Layer
 * @{
 */

/** DSPI_MSC - Size of Registers Arrays */
#define DSPI_MSC_MODE_CTAR_CTAR_COUNT             6u
#define DSPI_MSC_TXFR_COUNT                       16u
#define DSPI_MSC_RXFR_COUNT                       16u
#define DSPI_MSC_CTARE_COUNT                      6u

/** DSPI_MSC - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< Module Configuration Register, offset: 0x0 */
  uint8_t RESERVED_0[4];
  __IO uint32_t TCR;                               /**< Transfer Count Register, offset: 0x8 */
  union {                                          /* offset: 0xC */
    __IO uint32_t CTAR[DSPI_MSC_MODE_CTAR_CTAR_COUNT];   /**< Clock and Transfer Attributes Register (In Master Mode), array offset: 0xC, array step: 0x4 */
  } MODE;
  uint8_t RESERVED_1[8];
  __IO uint32_t SR;                                /**< Status Register, offset: 0x2C */
  __IO uint32_t RSER;                              /**< DMA/Interrupt Request Select and Enable Register, offset: 0x30 */
  union {                                          /* offset: 0x34 */
    __IO uint32_t PUSHR;                             /**< PUSH TX FIFO Register In Master Mode, offset: 0x34 */
  } PUSHR;
  __I  uint32_t POPR;                              /**< POP RX FIFO Register, offset: 0x38 */
  __I  uint32_t TXFR[DSPI_MSC_TXFR_COUNT];         /**< Transmit FIFO Registers, array offset: 0x3C, array step: 0x4 */
  __I  uint32_t RXFR[DSPI_MSC_RXFR_COUNT];         /**< Receive FIFO Registers, array offset: 0x7C, array step: 0x4 */
  __IO uint32_t DSICR0;                            /**< DSI Configuration Register 0, offset: 0xBC */
  __I  uint32_t SDR0;                              /**< DSI Serialization Data Register 0, offset: 0xC0 */
  __IO uint32_t ASDR0;                             /**< DSI Alternate Serialization Data Register 0, offset: 0xC4 */
  __I  uint32_t COMPR0;                            /**< DSI Transmit Comparison Register 0, offset: 0xC8 */
  __I  uint32_t DDR0;                              /**< DSI Deserialization Data Register 0, offset: 0xCC */
  __IO uint32_t DSICR1;                            /**< DSI Configuration Register 1, offset: 0xD0 */
  __IO uint32_t SSR0;                              /**< DSI Serialization Source Select Register 0, offset: 0xD4 */
  uint8_t RESERVED_2[16];
  __IO uint32_t DIMR0;                             /**< DSI Deserialized Data Interrupt Mask Register 0, offset: 0xE8 */
  __IO uint32_t DPIR0;                             /**< DSI Deserialized Data Polarity Interrupt Register 0, offset: 0xEC */
  __I  uint32_t SDR1;                              /**< DSI Serialization Data Register 1, offset: 0xF0 */
  __IO uint32_t ASDR1;                             /**< DSI Alternate Serialization Data Register 1, offset: 0xF4 */
  __I  uint32_t COMPR1;                            /**< DSI Transmit Comparison Register 1, offset: 0xF8 */
  __I  uint32_t DDR1;                              /**< DSI Deserialization Data Register 1, offset: 0xFC */
  __IO uint32_t SSR1;                              /**< DSI Serialization Source Select Register 1, offset: 0x100 */
  uint8_t RESERVED_3[16];
  __IO uint32_t DIMR1;                             /**< DSI Deserialized Data Interrupt Mask Register 1, offset: 0x114 */
  __IO uint32_t DPIR1;                             /**< DSI Deserialized Data Polarity Interrupt Register 1, offset: 0x118 */
  __IO uint32_t CTARE[DSPI_MSC_CTARE_COUNT];       /**< Clock and Transfer Attributes Register Extended, array offset: 0x11C, array step: 0x4 */
  uint8_t RESERVED_4[8];
  __I  uint32_t SREX;                              /**< Status Register Extended, offset: 0x13C */
  uint8_t RESERVED_5[16];
  __IO uint32_t TSL;                               /**< Time Slot Length Register, offset: 0x150 */
  __IO uint32_t TS_CONF;                           /**< Time Slot Configuration Register, offset: 0x154 */
} DSPI_MSC_Type, *DSPI_MSC_MemMapPtr;

/** Number of instances of the DSPI_MSC module. */
#define DSPI_MSC_INSTANCE_COUNT                  (1u)

/* DSPI_MSC - Peripheral instance base addresses */
/** Peripheral DSPI_MSC base address */
#define IP_DSPI_MSC_BASE                         (0x40508000u)
/** Peripheral DSPI_MSC base pointer */
#define IP_DSPI_MSC                              ((DSPI_MSC_Type *)IP_DSPI_MSC_BASE)
/** Array initializer of DSPI_MSC peripheral base addresses */
#define IP_DSPI_MSC_BASE_ADDRS                   { IP_DSPI_MSC_BASE }
/** Array initializer of DSPI_MSC peripheral base pointers */
#define IP_DSPI_MSC_BASE_PTRS                    { IP_DSPI_MSC }

/* ----------------------------------------------------------------------------
   -- DSPI_MSC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DSPI_MSC_Register_Masks DSPI_MSC Register Masks
 * @{
 */

/*! @name MCR - Module Configuration Register */
/*! @{ */

#define DSPI_MSC_MCR_HALT_MASK                   (0x1U)
#define DSPI_MSC_MCR_HALT_SHIFT                  (0U)
#define DSPI_MSC_MCR_HALT_WIDTH                  (1U)
#define DSPI_MSC_MCR_HALT(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_MCR_HALT_SHIFT)) & DSPI_MSC_MCR_HALT_MASK)

#define DSPI_MSC_MCR_XSPI_MASK                   (0x8U)
#define DSPI_MSC_MCR_XSPI_SHIFT                  (3U)
#define DSPI_MSC_MCR_XSPI_WIDTH                  (1U)
#define DSPI_MSC_MCR_XSPI(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_MCR_XSPI_SHIFT)) & DSPI_MSC_MCR_XSPI_MASK)

#define DSPI_MSC_MCR_CLR_RXF_MASK                (0x400U)
#define DSPI_MSC_MCR_CLR_RXF_SHIFT               (10U)
#define DSPI_MSC_MCR_CLR_RXF_WIDTH               (1U)
#define DSPI_MSC_MCR_CLR_RXF(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_MCR_CLR_RXF_SHIFT)) & DSPI_MSC_MCR_CLR_RXF_MASK)

#define DSPI_MSC_MCR_CLR_TXF_MASK                (0x800U)
#define DSPI_MSC_MCR_CLR_TXF_SHIFT               (11U)
#define DSPI_MSC_MCR_CLR_TXF_WIDTH               (1U)
#define DSPI_MSC_MCR_CLR_TXF(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_MCR_CLR_TXF_SHIFT)) & DSPI_MSC_MCR_CLR_TXF_MASK)

