zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DSPI_MSC.h
#define DSPI_MSC_MCR_DIS_RXF_MASK                (0x1000U)
#define DSPI_MSC_MCR_DIS_RXF_SHIFT               (12U)
#define DSPI_MSC_MCR_DIS_RXF_WIDTH               (1U)
#define DSPI_MSC_MCR_DIS_RXF(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_MCR_DIS_RXF_SHIFT)) & DSPI_MSC_MCR_DIS_RXF_MASK)

#define DSPI_MSC_MCR_DIS_TXF_MASK                (0x2000U)
#define DSPI_MSC_MCR_DIS_TXF_SHIFT               (13U)
#define DSPI_MSC_MCR_DIS_TXF_WIDTH               (1U)
#define DSPI_MSC_MCR_DIS_TXF(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_MCR_DIS_TXF_SHIFT)) & DSPI_MSC_MCR_DIS_TXF_MASK)

#define DSPI_MSC_MCR_MDIS_MASK                   (0x4000U)
#define DSPI_MSC_MCR_MDIS_SHIFT                  (14U)
#define DSPI_MSC_MCR_MDIS_WIDTH                  (1U)
#define DSPI_MSC_MCR_MDIS(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_MCR_MDIS_SHIFT)) & DSPI_MSC_MCR_MDIS_MASK)

#define DSPI_MSC_MCR_PCSIS_MASK                  (0x30000U)
#define DSPI_MSC_MCR_PCSIS_SHIFT                 (16U)
#define DSPI_MSC_MCR_PCSIS_WIDTH                 (2U)
#define DSPI_MSC_MCR_PCSIS(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_MCR_PCSIS_SHIFT)) & DSPI_MSC_MCR_PCSIS_MASK)

#define DSPI_MSC_MCR_ROOE_MASK                   (0x1000000U)
#define DSPI_MSC_MCR_ROOE_SHIFT                  (24U)
#define DSPI_MSC_MCR_ROOE_WIDTH                  (1U)
#define DSPI_MSC_MCR_ROOE(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_MCR_ROOE_SHIFT)) & DSPI_MSC_MCR_ROOE_MASK)

#define DSPI_MSC_MCR_FRZ_MASK                    (0x8000000U)
#define DSPI_MSC_MCR_FRZ_SHIFT                   (27U)
#define DSPI_MSC_MCR_FRZ_WIDTH                   (1U)
#define DSPI_MSC_MCR_FRZ(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_MCR_FRZ_SHIFT)) & DSPI_MSC_MCR_FRZ_MASK)

#define DSPI_MSC_MCR_DCONF_MASK                  (0x30000000U)
#define DSPI_MSC_MCR_DCONF_SHIFT                 (28U)
#define DSPI_MSC_MCR_DCONF_WIDTH                 (2U)
#define DSPI_MSC_MCR_DCONF(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_MCR_DCONF_SHIFT)) & DSPI_MSC_MCR_DCONF_MASK)

#define DSPI_MSC_MCR_CONT_SCKE_MASK              (0x40000000U)
#define DSPI_MSC_MCR_CONT_SCKE_SHIFT             (30U)
#define DSPI_MSC_MCR_CONT_SCKE_WIDTH             (1U)
#define DSPI_MSC_MCR_CONT_SCKE(x)                (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_MCR_CONT_SCKE_SHIFT)) & DSPI_MSC_MCR_CONT_SCKE_MASK)

#define DSPI_MSC_MCR_MSTR_MASK                   (0x80000000U)
#define DSPI_MSC_MCR_MSTR_SHIFT                  (31U)
#define DSPI_MSC_MCR_MSTR_WIDTH                  (1U)
#define DSPI_MSC_MCR_MSTR(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_MCR_MSTR_SHIFT)) & DSPI_MSC_MCR_MSTR_MASK)
/*! @} */

/*! @name TCR - Transfer Count Register */
/*! @{ */

#define DSPI_MSC_TCR_SPI_TCNT_MASK               (0xFFFF0000U)
#define DSPI_MSC_TCR_SPI_TCNT_SHIFT              (16U)
#define DSPI_MSC_TCR_SPI_TCNT_WIDTH              (16U)
#define DSPI_MSC_TCR_SPI_TCNT(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_TCR_SPI_TCNT_SHIFT)) & DSPI_MSC_TCR_SPI_TCNT_MASK)
/*! @} */

/*! @name CTAR - Clock and Transfer Attributes Register (In Master Mode) */
/*! @{ */

#define DSPI_MSC_CTAR_BR_MASK                    (0xFU)
#define DSPI_MSC_CTAR_BR_SHIFT                   (0U)
#define DSPI_MSC_CTAR_BR_WIDTH                   (4U)
#define DSPI_MSC_CTAR_BR(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_CTAR_BR_SHIFT)) & DSPI_MSC_CTAR_BR_MASK)

#define DSPI_MSC_CTAR_DT_MASK                    (0xF0U)
#define DSPI_MSC_CTAR_DT_SHIFT                   (4U)
#define DSPI_MSC_CTAR_DT_WIDTH                   (4U)
#define DSPI_MSC_CTAR_DT(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_CTAR_DT_SHIFT)) & DSPI_MSC_CTAR_DT_MASK)

#define DSPI_MSC_CTAR_ASC_MASK                   (0xF00U)
#define DSPI_MSC_CTAR_ASC_SHIFT                  (8U)
#define DSPI_MSC_CTAR_ASC_WIDTH                  (4U)
#define DSPI_MSC_CTAR_ASC(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_CTAR_ASC_SHIFT)) & DSPI_MSC_CTAR_ASC_MASK)

#define DSPI_MSC_CTAR_CSSCK_MASK                 (0xF000U)
#define DSPI_MSC_CTAR_CSSCK_SHIFT                (12U)
#define DSPI_MSC_CTAR_CSSCK_WIDTH                (4U)
#define DSPI_MSC_CTAR_CSSCK(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_CTAR_CSSCK_SHIFT)) & DSPI_MSC_CTAR_CSSCK_MASK)

#define DSPI_MSC_CTAR_PBR_MASK                   (0x30000U)
#define DSPI_MSC_CTAR_PBR_SHIFT                  (16U)
#define DSPI_MSC_CTAR_PBR_WIDTH                  (2U)
#define DSPI_MSC_CTAR_PBR(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_CTAR_PBR_SHIFT)) & DSPI_MSC_CTAR_PBR_MASK)

#define DSPI_MSC_CTAR_PDT_MASK                   (0xC0000U)
#define DSPI_MSC_CTAR_PDT_SHIFT                  (18U)
#define DSPI_MSC_CTAR_PDT_WIDTH                  (2U)
#define DSPI_MSC_CTAR_PDT(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_CTAR_PDT_SHIFT)) & DSPI_MSC_CTAR_PDT_MASK)

#define DSPI_MSC_CTAR_PASC_MASK                  (0x300000U)
#define DSPI_MSC_CTAR_PASC_SHIFT                 (20U)
#define DSPI_MSC_CTAR_PASC_WIDTH                 (2U)
#define DSPI_MSC_CTAR_PASC(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_CTAR_PASC_SHIFT)) & DSPI_MSC_CTAR_PASC_MASK)

#define DSPI_MSC_CTAR_PCSSCK_MASK                (0xC00000U)
#define DSPI_MSC_CTAR_PCSSCK_SHIFT               (22U)
#define DSPI_MSC_CTAR_PCSSCK_WIDTH               (2U)
#define DSPI_MSC_CTAR_PCSSCK(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_CTAR_PCSSCK_SHIFT)) & DSPI_MSC_CTAR_PCSSCK_MASK)

#define DSPI_MSC_CTAR_LSBFE_MASK                 (0x1000000U)
#define DSPI_MSC_CTAR_LSBFE_SHIFT                (24U)
#define DSPI_MSC_CTAR_LSBFE_WIDTH                (1U)
#define DSPI_MSC_CTAR_LSBFE(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_CTAR_LSBFE_SHIFT)) & DSPI_MSC_CTAR_LSBFE_MASK)

#define DSPI_MSC_CTAR_CPHA_MASK                  (0x2000000U)
#define DSPI_MSC_CTAR_CPHA_SHIFT                 (25U)
#define DSPI_MSC_CTAR_CPHA_WIDTH                 (1U)
#define DSPI_MSC_CTAR_CPHA(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_CTAR_CPHA_SHIFT)) & DSPI_MSC_CTAR_CPHA_MASK)

#define DSPI_MSC_CTAR_CPOL_MASK                  (0x4000000U)
#define DSPI_MSC_CTAR_CPOL_SHIFT                 (26U)
#define DSPI_MSC_CTAR_CPOL_WIDTH                 (1U)
#define DSPI_MSC_CTAR_CPOL(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_CTAR_CPOL_SHIFT)) & DSPI_MSC_CTAR_CPOL_MASK)

#define DSPI_MSC_CTAR_FMSZ_MASK                  (0x78000000U)
#define DSPI_MSC_CTAR_FMSZ_SHIFT                 (27U)
#define DSPI_MSC_CTAR_FMSZ_WIDTH                 (4U)
#define DSPI_MSC_CTAR_FMSZ(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_CTAR_FMSZ_SHIFT)) & DSPI_MSC_CTAR_FMSZ_MASK)

#define DSPI_MSC_CTAR_DBR_MASK                   (0x80000000U)
#define DSPI_MSC_CTAR_DBR_SHIFT                  (31U)
#define DSPI_MSC_CTAR_DBR_WIDTH                  (1U)
#define DSPI_MSC_CTAR_DBR(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_CTAR_DBR_SHIFT)) & DSPI_MSC_CTAR_DBR_MASK)
/*! @} */

/*! @name SR - Status Register */
/*! @{ */

