zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DSPI_MSC.h
#define DSPI_MSC_SR_POPNXTPTR_MASK               (0xFU)
#define DSPI_MSC_SR_POPNXTPTR_SHIFT              (0U)
#define DSPI_MSC_SR_POPNXTPTR_WIDTH              (4U)
#define DSPI_MSC_SR_POPNXTPTR(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SR_POPNXTPTR_SHIFT)) & DSPI_MSC_SR_POPNXTPTR_MASK)

#define DSPI_MSC_SR_RXCTR_MASK                   (0xF0U)
#define DSPI_MSC_SR_RXCTR_SHIFT                  (4U)
#define DSPI_MSC_SR_RXCTR_WIDTH                  (4U)
#define DSPI_MSC_SR_RXCTR(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SR_RXCTR_SHIFT)) & DSPI_MSC_SR_RXCTR_MASK)

#define DSPI_MSC_SR_TXNXTPTR_MASK                (0xF00U)
#define DSPI_MSC_SR_TXNXTPTR_SHIFT               (8U)
#define DSPI_MSC_SR_TXNXTPTR_WIDTH               (4U)
#define DSPI_MSC_SR_TXNXTPTR(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SR_TXNXTPTR_SHIFT)) & DSPI_MSC_SR_TXNXTPTR_MASK)

#define DSPI_MSC_SR_TXCTR_MASK                   (0xF000U)
#define DSPI_MSC_SR_TXCTR_SHIFT                  (12U)
#define DSPI_MSC_SR_TXCTR_WIDTH                  (4U)
#define DSPI_MSC_SR_TXCTR(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SR_TXCTR_SHIFT)) & DSPI_MSC_SR_TXCTR_MASK)

#define DSPI_MSC_SR_CMDFFF_MASK                  (0x10000U)
#define DSPI_MSC_SR_CMDFFF_SHIFT                 (16U)
#define DSPI_MSC_SR_CMDFFF_WIDTH                 (1U)
#define DSPI_MSC_SR_CMDFFF(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SR_CMDFFF_SHIFT)) & DSPI_MSC_SR_CMDFFF_MASK)

#define DSPI_MSC_SR_RFDF_MASK                    (0x20000U)
#define DSPI_MSC_SR_RFDF_SHIFT                   (17U)
#define DSPI_MSC_SR_RFDF_WIDTH                   (1U)
#define DSPI_MSC_SR_RFDF(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SR_RFDF_SHIFT)) & DSPI_MSC_SR_RFDF_MASK)

#define DSPI_MSC_SR_TFIWF_MASK                   (0x40000U)
#define DSPI_MSC_SR_TFIWF_SHIFT                  (18U)
#define DSPI_MSC_SR_TFIWF_WIDTH                  (1U)
#define DSPI_MSC_SR_TFIWF(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SR_TFIWF_SHIFT)) & DSPI_MSC_SR_TFIWF_MASK)

#define DSPI_MSC_SR_RFOF_MASK                    (0x80000U)
#define DSPI_MSC_SR_RFOF_SHIFT                   (19U)
#define DSPI_MSC_SR_RFOF_WIDTH                   (1U)
#define DSPI_MSC_SR_RFOF(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SR_RFOF_SHIFT)) & DSPI_MSC_SR_RFOF_MASK)

#define DSPI_MSC_SR_DDIF_MASK                    (0x100000U)
#define DSPI_MSC_SR_DDIF_SHIFT                   (20U)
#define DSPI_MSC_SR_DDIF_WIDTH                   (1U)
#define DSPI_MSC_SR_DDIF(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SR_DDIF_SHIFT)) & DSPI_MSC_SR_DDIF_MASK)

#define DSPI_MSC_SR_CMDTCF_MASK                  (0x800000U)
#define DSPI_MSC_SR_CMDTCF_SHIFT                 (23U)
#define DSPI_MSC_SR_CMDTCF_WIDTH                 (1U)
#define DSPI_MSC_SR_CMDTCF(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SR_CMDTCF_SHIFT)) & DSPI_MSC_SR_CMDTCF_MASK)

#define DSPI_MSC_SR_BSYF_MASK                    (0x1000000U)
#define DSPI_MSC_SR_BSYF_SHIFT                   (24U)
#define DSPI_MSC_SR_BSYF_WIDTH                   (1U)
#define DSPI_MSC_SR_BSYF(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SR_BSYF_SHIFT)) & DSPI_MSC_SR_BSYF_MASK)

#define DSPI_MSC_SR_TFFF_MASK                    (0x2000000U)
#define DSPI_MSC_SR_TFFF_SHIFT                   (25U)
#define DSPI_MSC_SR_TFFF_WIDTH                   (1U)
#define DSPI_MSC_SR_TFFF(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SR_TFFF_SHIFT)) & DSPI_MSC_SR_TFFF_MASK)

#define DSPI_MSC_SR_DSITCF_MASK                  (0x4000000U)
#define DSPI_MSC_SR_DSITCF_SHIFT                 (26U)
#define DSPI_MSC_SR_DSITCF_WIDTH                 (1U)
#define DSPI_MSC_SR_DSITCF(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SR_DSITCF_SHIFT)) & DSPI_MSC_SR_DSITCF_MASK)

#define DSPI_MSC_SR_EOQF_MASK                    (0x10000000U)
#define DSPI_MSC_SR_EOQF_SHIFT                   (28U)
#define DSPI_MSC_SR_EOQF_WIDTH                   (1U)
#define DSPI_MSC_SR_EOQF(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SR_EOQF_SHIFT)) & DSPI_MSC_SR_EOQF_MASK)

#define DSPI_MSC_SR_SPITCF_MASK                  (0x20000000U)
#define DSPI_MSC_SR_SPITCF_SHIFT                 (29U)
#define DSPI_MSC_SR_SPITCF_WIDTH                 (1U)
#define DSPI_MSC_SR_SPITCF(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SR_SPITCF_SHIFT)) & DSPI_MSC_SR_SPITCF_MASK)

#define DSPI_MSC_SR_TXRXS_MASK                   (0x40000000U)
#define DSPI_MSC_SR_TXRXS_SHIFT                  (30U)
#define DSPI_MSC_SR_TXRXS_WIDTH                  (1U)
#define DSPI_MSC_SR_TXRXS(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SR_TXRXS_SHIFT)) & DSPI_MSC_SR_TXRXS_MASK)

#define DSPI_MSC_SR_TCF_MASK                     (0x80000000U)
#define DSPI_MSC_SR_TCF_SHIFT                    (31U)
#define DSPI_MSC_SR_TCF_WIDTH                    (1U)
#define DSPI_MSC_SR_TCF(x)                       (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SR_TCF_SHIFT)) & DSPI_MSC_SR_TCF_MASK)
/*! @} */

/*! @name RSER - DMA/Interrupt Request Select and Enable Register */
/*! @{ */

#define DSPI_MSC_RSER_DDIF_DIRS_MASK             (0x4000U)
#define DSPI_MSC_RSER_DDIF_DIRS_SHIFT            (14U)
#define DSPI_MSC_RSER_DDIF_DIRS_WIDTH            (1U)
#define DSPI_MSC_RSER_DDIF_DIRS(x)               (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_RSER_DDIF_DIRS_SHIFT)) & DSPI_MSC_RSER_DDIF_DIRS_MASK)

#define DSPI_MSC_RSER_CMDFFF_DIRS_MASK           (0x8000U)
#define DSPI_MSC_RSER_CMDFFF_DIRS_SHIFT          (15U)
#define DSPI_MSC_RSER_CMDFFF_DIRS_WIDTH          (1U)
#define DSPI_MSC_RSER_CMDFFF_DIRS(x)             (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_RSER_CMDFFF_DIRS_SHIFT)) & DSPI_MSC_RSER_CMDFFF_DIRS_MASK)

#define DSPI_MSC_RSER_RFDF_DIRS_MASK             (0x10000U)
#define DSPI_MSC_RSER_RFDF_DIRS_SHIFT            (16U)
#define DSPI_MSC_RSER_RFDF_DIRS_WIDTH            (1U)
#define DSPI_MSC_RSER_RFDF_DIRS(x)               (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_RSER_RFDF_DIRS_SHIFT)) & DSPI_MSC_RSER_RFDF_DIRS_MASK)

#define DSPI_MSC_RSER_RFDF_RE_MASK               (0x20000U)
#define DSPI_MSC_RSER_RFDF_RE_SHIFT              (17U)
#define DSPI_MSC_RSER_RFDF_RE_WIDTH              (1U)
#define DSPI_MSC_RSER_RFDF_RE(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_RSER_RFDF_RE_SHIFT)) & DSPI_MSC_RSER_RFDF_RE_MASK)

#define DSPI_MSC_RSER_TFIWF_RE_MASK              (0x40000U)
#define DSPI_MSC_RSER_TFIWF_RE_SHIFT             (18U)
#define DSPI_MSC_RSER_TFIWF_RE_WIDTH             (1U)
#define DSPI_MSC_RSER_TFIWF_RE(x)                (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_RSER_TFIWF_RE_SHIFT)) & DSPI_MSC_RSER_TFIWF_RE_MASK)

