zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DSPI_MSC.h
#define DSPI_MSC_RSER_RFOF_RE_MASK               (0x80000U)
#define DSPI_MSC_RSER_RFOF_RE_SHIFT              (19U)
#define DSPI_MSC_RSER_RFOF_RE_WIDTH              (1U)
#define DSPI_MSC_RSER_RFOF_RE(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_RSER_RFOF_RE_SHIFT)) & DSPI_MSC_RSER_RFOF_RE_MASK)

#define DSPI_MSC_RSER_DDIF_RE_MASK               (0x100000U)
#define DSPI_MSC_RSER_DDIF_RE_SHIFT              (20U)
#define DSPI_MSC_RSER_DDIF_RE_WIDTH              (1U)
#define DSPI_MSC_RSER_DDIF_RE(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_RSER_DDIF_RE_SHIFT)) & DSPI_MSC_RSER_DDIF_RE_MASK)

#define DSPI_MSC_RSER_CMDTCF_RE_MASK             (0x800000U)
#define DSPI_MSC_RSER_CMDTCF_RE_SHIFT            (23U)
#define DSPI_MSC_RSER_CMDTCF_RE_WIDTH            (1U)
#define DSPI_MSC_RSER_CMDTCF_RE(x)               (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_RSER_CMDTCF_RE_SHIFT)) & DSPI_MSC_RSER_CMDTCF_RE_MASK)

#define DSPI_MSC_RSER_TFFF_DIRS_MASK             (0x1000000U)
#define DSPI_MSC_RSER_TFFF_DIRS_SHIFT            (24U)
#define DSPI_MSC_RSER_TFFF_DIRS_WIDTH            (1U)
#define DSPI_MSC_RSER_TFFF_DIRS(x)               (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_RSER_TFFF_DIRS_SHIFT)) & DSPI_MSC_RSER_TFFF_DIRS_MASK)

#define DSPI_MSC_RSER_TFFF_RE_MASK               (0x2000000U)
#define DSPI_MSC_RSER_TFFF_RE_SHIFT              (25U)
#define DSPI_MSC_RSER_TFFF_RE_WIDTH              (1U)
#define DSPI_MSC_RSER_TFFF_RE(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_RSER_TFFF_RE_SHIFT)) & DSPI_MSC_RSER_TFFF_RE_MASK)

#define DSPI_MSC_RSER_DSITCF_RE_MASK             (0x4000000U)
#define DSPI_MSC_RSER_DSITCF_RE_SHIFT            (26U)
#define DSPI_MSC_RSER_DSITCF_RE_WIDTH            (1U)
#define DSPI_MSC_RSER_DSITCF_RE(x)               (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_RSER_DSITCF_RE_SHIFT)) & DSPI_MSC_RSER_DSITCF_RE_MASK)

#define DSPI_MSC_RSER_EOQF_RE_MASK               (0x10000000U)
#define DSPI_MSC_RSER_EOQF_RE_SHIFT              (28U)
#define DSPI_MSC_RSER_EOQF_RE_WIDTH              (1U)
#define DSPI_MSC_RSER_EOQF_RE(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_RSER_EOQF_RE_SHIFT)) & DSPI_MSC_RSER_EOQF_RE_MASK)

#define DSPI_MSC_RSER_SPITCF_RE_MASK             (0x20000000U)
#define DSPI_MSC_RSER_SPITCF_RE_SHIFT            (29U)
#define DSPI_MSC_RSER_SPITCF_RE_WIDTH            (1U)
#define DSPI_MSC_RSER_SPITCF_RE(x)               (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_RSER_SPITCF_RE_SHIFT)) & DSPI_MSC_RSER_SPITCF_RE_MASK)

#define DSPI_MSC_RSER_CMDFFF_RE_MASK             (0x40000000U)
#define DSPI_MSC_RSER_CMDFFF_RE_SHIFT            (30U)
#define DSPI_MSC_RSER_CMDFFF_RE_WIDTH            (1U)
#define DSPI_MSC_RSER_CMDFFF_RE(x)               (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_RSER_CMDFFF_RE_SHIFT)) & DSPI_MSC_RSER_CMDFFF_RE_MASK)

#define DSPI_MSC_RSER_TCF_RE_MASK                (0x80000000U)
#define DSPI_MSC_RSER_TCF_RE_SHIFT               (31U)
#define DSPI_MSC_RSER_TCF_RE_WIDTH               (1U)
#define DSPI_MSC_RSER_TCF_RE(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_RSER_TCF_RE_SHIFT)) & DSPI_MSC_RSER_TCF_RE_MASK)
/*! @} */

/*! @name PUSHR - PUSH TX FIFO Register In Master Mode */
/*! @{ */

#define DSPI_MSC_PUSHR_TXDATA_MASK               (0xFFFFU)
#define DSPI_MSC_PUSHR_TXDATA_SHIFT              (0U)
#define DSPI_MSC_PUSHR_TXDATA_WIDTH              (16U)
#define DSPI_MSC_PUSHR_TXDATA(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_PUSHR_TXDATA_SHIFT)) & DSPI_MSC_PUSHR_TXDATA_MASK)

#define DSPI_MSC_PUSHR_PCS_MASK                  (0x30000U)
#define DSPI_MSC_PUSHR_PCS_SHIFT                 (16U)
#define DSPI_MSC_PUSHR_PCS_WIDTH                 (2U)
#define DSPI_MSC_PUSHR_PCS(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_PUSHR_PCS_SHIFT)) & DSPI_MSC_PUSHR_PCS_MASK)

#define DSPI_MSC_PUSHR_CTCNT_MASK                (0x4000000U)
#define DSPI_MSC_PUSHR_CTCNT_SHIFT               (26U)
#define DSPI_MSC_PUSHR_CTCNT_WIDTH               (1U)
#define DSPI_MSC_PUSHR_CTCNT(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_PUSHR_CTCNT_SHIFT)) & DSPI_MSC_PUSHR_CTCNT_MASK)

#define DSPI_MSC_PUSHR_EOQ_MASK                  (0x8000000U)
#define DSPI_MSC_PUSHR_EOQ_SHIFT                 (27U)
#define DSPI_MSC_PUSHR_EOQ_WIDTH                 (1U)
#define DSPI_MSC_PUSHR_EOQ(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_PUSHR_EOQ_SHIFT)) & DSPI_MSC_PUSHR_EOQ_MASK)

#define DSPI_MSC_PUSHR_CTAS_MASK                 (0x70000000U)
#define DSPI_MSC_PUSHR_CTAS_SHIFT                (28U)
#define DSPI_MSC_PUSHR_CTAS_WIDTH                (3U)
#define DSPI_MSC_PUSHR_CTAS(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_PUSHR_CTAS_SHIFT)) & DSPI_MSC_PUSHR_CTAS_MASK)

#define DSPI_MSC_PUSHR_CONT_MASK                 (0x80000000U)
#define DSPI_MSC_PUSHR_CONT_SHIFT                (31U)
#define DSPI_MSC_PUSHR_CONT_WIDTH                (1U)
#define DSPI_MSC_PUSHR_CONT(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_PUSHR_CONT_SHIFT)) & DSPI_MSC_PUSHR_CONT_MASK)
/*! @} */

/*! @name POPR - POP RX FIFO Register */
/*! @{ */

#define DSPI_MSC_POPR_RXDATA_MASK                (0xFFFFFFFFU)
#define DSPI_MSC_POPR_RXDATA_SHIFT               (0U)
#define DSPI_MSC_POPR_RXDATA_WIDTH               (32U)
#define DSPI_MSC_POPR_RXDATA(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_POPR_RXDATA_SHIFT)) & DSPI_MSC_POPR_RXDATA_MASK)
/*! @} */

/*! @name TXFR - Transmit FIFO Registers */
/*! @{ */

#define DSPI_MSC_TXFR_TXDATA_MASK                (0xFFFFU)
#define DSPI_MSC_TXFR_TXDATA_SHIFT               (0U)
#define DSPI_MSC_TXFR_TXDATA_WIDTH               (16U)
#define DSPI_MSC_TXFR_TXDATA(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_TXFR_TXDATA_SHIFT)) & DSPI_MSC_TXFR_TXDATA_MASK)

#define DSPI_MSC_TXFR_TXCMD_TXDATA_MASK          (0xFFFF0000U)
#define DSPI_MSC_TXFR_TXCMD_TXDATA_SHIFT         (16U)
#define DSPI_MSC_TXFR_TXCMD_TXDATA_WIDTH         (16U)
#define DSPI_MSC_TXFR_TXCMD_TXDATA(x)            (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_TXFR_TXCMD_TXDATA_SHIFT)) & DSPI_MSC_TXFR_TXCMD_TXDATA_MASK)
/*! @} */

/*! @name RXFR - Receive FIFO Registers */
/*! @{ */

