zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DSPI_MSC.h
#define DSPI_MSC_RXFR_RXDATA_MASK                (0xFFFFFFFFU)
#define DSPI_MSC_RXFR_RXDATA_SHIFT               (0U)
#define DSPI_MSC_RXFR_RXDATA_WIDTH               (32U)
#define DSPI_MSC_RXFR_RXDATA(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_RXFR_RXDATA_SHIFT)) & DSPI_MSC_RXFR_RXDATA_MASK)
/*! @} */

/*! @name DSICR0 - DSI Configuration Register 0 */
/*! @{ */

#define DSPI_MSC_DSICR0_DPCSx_MASK               (0xFFU)
#define DSPI_MSC_DSICR0_DPCSx_SHIFT              (0U)
#define DSPI_MSC_DSICR0_DPCSx_WIDTH              (8U)
#define DSPI_MSC_DSICR0_DPCSx(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DSICR0_DPCSx_SHIFT)) & DSPI_MSC_DSICR0_DPCSx_MASK)

#define DSPI_MSC_DSICR0_DMS_MASK                 (0x800U)
#define DSPI_MSC_DSICR0_DMS_SHIFT                (11U)
#define DSPI_MSC_DSICR0_DMS_WIDTH                (1U)
#define DSPI_MSC_DSICR0_DMS(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DSICR0_DMS_SHIFT)) & DSPI_MSC_DSICR0_DMS_MASK)

#define DSPI_MSC_DSICR0_DSICTAS_MASK             (0x7000U)
#define DSPI_MSC_DSICR0_DSICTAS_SHIFT            (12U)
#define DSPI_MSC_DSICR0_DSICTAS_WIDTH            (3U)
#define DSPI_MSC_DSICR0_DSICTAS(x)               (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DSICR0_DSICTAS_SHIFT)) & DSPI_MSC_DSICR0_DSICTAS_MASK)

#define DSPI_MSC_DSICR0_DCONT_MASK               (0x8000U)
#define DSPI_MSC_DSICR0_DCONT_SHIFT              (15U)
#define DSPI_MSC_DSICR0_DCONT_WIDTH              (1U)
#define DSPI_MSC_DSICR0_DCONT(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DSICR0_DCONT_SHIFT)) & DSPI_MSC_DSICR0_DCONT_MASK)

#define DSPI_MSC_DSICR0_CID_MASK                 (0x10000U)
#define DSPI_MSC_DSICR0_CID_SHIFT                (16U)
#define DSPI_MSC_DSICR0_CID_WIDTH                (1U)
#define DSPI_MSC_DSICR0_CID(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DSICR0_CID_SHIFT)) & DSPI_MSC_DSICR0_CID_MASK)

#define DSPI_MSC_DSICR0_TRRE_MASK                (0x20000U)
#define DSPI_MSC_DSICR0_TRRE_SHIFT               (17U)
#define DSPI_MSC_DSICR0_TRRE_WIDTH               (1U)
#define DSPI_MSC_DSICR0_TRRE(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DSICR0_TRRE_SHIFT)) & DSPI_MSC_DSICR0_TRRE_MASK)

#define DSPI_MSC_DSICR0_TPOL_MASK                (0x40000U)
#define DSPI_MSC_DSICR0_TPOL_SHIFT               (18U)
#define DSPI_MSC_DSICR0_TPOL_WIDTH               (1U)
#define DSPI_MSC_DSICR0_TPOL(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DSICR0_TPOL_SHIFT)) & DSPI_MSC_DSICR0_TPOL_MASK)

#define DSPI_MSC_DSICR0_TXSS_MASK                (0x80000U)
#define DSPI_MSC_DSICR0_TXSS_SHIFT               (19U)
#define DSPI_MSC_DSICR0_TXSS_WIDTH               (1U)
#define DSPI_MSC_DSICR0_TXSS(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DSICR0_TXSS_SHIFT)) & DSPI_MSC_DSICR0_TXSS_MASK)

#define DSPI_MSC_DSICR0_TSBC_MASK                (0x100000U)
#define DSPI_MSC_DSICR0_TSBC_SHIFT               (20U)
#define DSPI_MSC_DSICR0_TSBC_WIDTH               (1U)
#define DSPI_MSC_DSICR0_TSBC(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DSICR0_TSBC_SHIFT)) & DSPI_MSC_DSICR0_TSBC_MASK)

#define DSPI_MSC_DSICR0_ITSB_MASK                (0x200000U)
#define DSPI_MSC_DSICR0_ITSB_SHIFT               (21U)
#define DSPI_MSC_DSICR0_ITSB_WIDTH               (1U)
#define DSPI_MSC_DSICR0_ITSB(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DSICR0_ITSB_SHIFT)) & DSPI_MSC_DSICR0_ITSB_MASK)

#define DSPI_MSC_DSICR0_TRG_MASK                 (0x400000U)
#define DSPI_MSC_DSICR0_TRG_SHIFT                (22U)
#define DSPI_MSC_DSICR0_TRG_WIDTH                (1U)
#define DSPI_MSC_DSICR0_TRG(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DSICR0_TRG_SHIFT)) & DSPI_MSC_DSICR0_TRG_MASK)

#define DSPI_MSC_DSICR0_FMSZ5_MASK               (0x800000U)
#define DSPI_MSC_DSICR0_FMSZ5_SHIFT              (23U)
#define DSPI_MSC_DSICR0_FMSZ5_WIDTH              (1U)
#define DSPI_MSC_DSICR0_FMSZ5(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DSICR0_FMSZ5_SHIFT)) & DSPI_MSC_DSICR0_FMSZ5_MASK)

#define DSPI_MSC_DSICR0_FMSZ4_MASK               (0x40000000U)
#define DSPI_MSC_DSICR0_FMSZ4_SHIFT              (30U)
#define DSPI_MSC_DSICR0_FMSZ4_WIDTH              (1U)
#define DSPI_MSC_DSICR0_FMSZ4(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DSICR0_FMSZ4_SHIFT)) & DSPI_MSC_DSICR0_FMSZ4_MASK)
/*! @} */

/*! @name SDR0 - DSI Serialization Data Register 0 */
/*! @{ */

#define DSPI_MSC_SDR0_SER_DATA_MASK              (0xFFFFFFFFU)
#define DSPI_MSC_SDR0_SER_DATA_SHIFT             (0U)
#define DSPI_MSC_SDR0_SER_DATA_WIDTH             (32U)
#define DSPI_MSC_SDR0_SER_DATA(x)                (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SDR0_SER_DATA_SHIFT)) & DSPI_MSC_SDR0_SER_DATA_MASK)
/*! @} */

/*! @name ASDR0 - DSI Alternate Serialization Data Register 0 */
/*! @{ */

#define DSPI_MSC_ASDR0_ASER_DATA_MASK            (0xFFFFFFFFU)
#define DSPI_MSC_ASDR0_ASER_DATA_SHIFT           (0U)
#define DSPI_MSC_ASDR0_ASER_DATA_WIDTH           (32U)
#define DSPI_MSC_ASDR0_ASER_DATA(x)              (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_ASDR0_ASER_DATA_SHIFT)) & DSPI_MSC_ASDR0_ASER_DATA_MASK)
/*! @} */

/*! @name COMPR0 - DSI Transmit Comparison Register 0 */
/*! @{ */

#define DSPI_MSC_COMPR0_COMP_DATA_MASK           (0xFFFFFFFFU)
#define DSPI_MSC_COMPR0_COMP_DATA_SHIFT          (0U)
#define DSPI_MSC_COMPR0_COMP_DATA_WIDTH          (32U)
#define DSPI_MSC_COMPR0_COMP_DATA(x)             (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_COMPR0_COMP_DATA_SHIFT)) & DSPI_MSC_COMPR0_COMP_DATA_MASK)
/*! @} */

/*! @name DDR0 - DSI Deserialization Data Register 0 */
/*! @{ */

#define DSPI_MSC_DDR0_DESER_DATA_MASK            (0xFFFFFFFFU)
#define DSPI_MSC_DDR0_DESER_DATA_SHIFT           (0U)
#define DSPI_MSC_DDR0_DESER_DATA_WIDTH           (32U)
#define DSPI_MSC_DDR0_DESER_DATA(x)              (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DDR0_DESER_DATA_SHIFT)) & DSPI_MSC_DDR0_DESER_DATA_MASK)
/*! @} */

