zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DSPI_MSC.h
/*! @name DSICR1 - DSI Configuration Register 1 */
/*! @{ */

#define DSPI_MSC_DSICR1_DPCS1_x_MASK             (0xFFU)
#define DSPI_MSC_DSICR1_DPCS1_x_SHIFT            (0U)
#define DSPI_MSC_DSICR1_DPCS1_x_WIDTH            (8U)
#define DSPI_MSC_DSICR1_DPCS1_x(x)               (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DSICR1_DPCS1_x_SHIFT)) & DSPI_MSC_DSICR1_DPCS1_x_MASK)

#define DSPI_MSC_DSICR1_DSE0_MASK                (0x10000U)
#define DSPI_MSC_DSICR1_DSE0_SHIFT               (16U)
#define DSPI_MSC_DSICR1_DSE0_WIDTH               (1U)
#define DSPI_MSC_DSICR1_DSE0(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DSICR1_DSE0_SHIFT)) & DSPI_MSC_DSICR1_DSE0_MASK)

#define DSPI_MSC_DSICR1_DSE1_MASK                (0x20000U)
#define DSPI_MSC_DSICR1_DSE1_SHIFT               (17U)
#define DSPI_MSC_DSICR1_DSE1_WIDTH               (1U)
#define DSPI_MSC_DSICR1_DSE1(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DSICR1_DSE1_SHIFT)) & DSPI_MSC_DSICR1_DSE1_MASK)

#define DSPI_MSC_DSICR1_DSI64E_MASK              (0x40000U)
#define DSPI_MSC_DSICR1_DSI64E_SHIFT             (18U)
#define DSPI_MSC_DSICR1_DSI64E_WIDTH             (1U)
#define DSPI_MSC_DSICR1_DSI64E(x)                (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DSICR1_DSI64E_SHIFT)) & DSPI_MSC_DSICR1_DSI64E_MASK)

#define DSPI_MSC_DSICR1_CSE_MASK                 (0x80000U)
#define DSPI_MSC_DSICR1_CSE_SHIFT                (19U)
#define DSPI_MSC_DSICR1_CSE_WIDTH                (1U)
#define DSPI_MSC_DSICR1_CSE(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DSICR1_CSE_SHIFT)) & DSPI_MSC_DSICR1_CSE_MASK)

#define DSPI_MSC_DSICR1_TSBCNT_MASK              (0x3F000000U)
#define DSPI_MSC_DSICR1_TSBCNT_SHIFT             (24U)
#define DSPI_MSC_DSICR1_TSBCNT_WIDTH             (6U)
#define DSPI_MSC_DSICR1_TSBCNT(x)                (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DSICR1_TSBCNT_SHIFT)) & DSPI_MSC_DSICR1_TSBCNT_MASK)
/*! @} */

/*! @name SSR0 - DSI Serialization Source Select Register 0 */
/*! @{ */

#define DSPI_MSC_SSR0_SS_MASK                    (0xFFFFFFFFU)
#define DSPI_MSC_SSR0_SS_SHIFT                   (0U)
#define DSPI_MSC_SSR0_SS_WIDTH                   (32U)
#define DSPI_MSC_SSR0_SS(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SSR0_SS_SHIFT)) & DSPI_MSC_SSR0_SS_MASK)
/*! @} */

/*! @name DIMR0 - DSI Deserialized Data Interrupt Mask Register 0 */
/*! @{ */

#define DSPI_MSC_DIMR0_MASK_MASK                 (0xFFFFFFFFU)
#define DSPI_MSC_DIMR0_MASK_SHIFT                (0U)
#define DSPI_MSC_DIMR0_MASK_WIDTH                (32U)
#define DSPI_MSC_DIMR0_MASK(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DIMR0_MASK_SHIFT)) & DSPI_MSC_DIMR0_MASK_MASK)
/*! @} */

/*! @name DPIR0 - DSI Deserialized Data Polarity Interrupt Register 0 */
/*! @{ */

#define DSPI_MSC_DPIR0_DP_MASK                   (0xFFFFFFFFU)
#define DSPI_MSC_DPIR0_DP_SHIFT                  (0U)
#define DSPI_MSC_DPIR0_DP_WIDTH                  (32U)
#define DSPI_MSC_DPIR0_DP(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DPIR0_DP_SHIFT)) & DSPI_MSC_DPIR0_DP_MASK)
/*! @} */

/*! @name SDR1 - DSI Serialization Data Register 1 */
/*! @{ */

#define DSPI_MSC_SDR1_SER_DATA_MASK              (0xFFFFFFFFU)
#define DSPI_MSC_SDR1_SER_DATA_SHIFT             (0U)
#define DSPI_MSC_SDR1_SER_DATA_WIDTH             (32U)
#define DSPI_MSC_SDR1_SER_DATA(x)                (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SDR1_SER_DATA_SHIFT)) & DSPI_MSC_SDR1_SER_DATA_MASK)
/*! @} */

/*! @name ASDR1 - DSI Alternate Serialization Data Register 1 */
/*! @{ */

#define DSPI_MSC_ASDR1_ASER_DATA_MASK            (0xFFFFFFFFU)
#define DSPI_MSC_ASDR1_ASER_DATA_SHIFT           (0U)
#define DSPI_MSC_ASDR1_ASER_DATA_WIDTH           (32U)
#define DSPI_MSC_ASDR1_ASER_DATA(x)              (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_ASDR1_ASER_DATA_SHIFT)) & DSPI_MSC_ASDR1_ASER_DATA_MASK)
/*! @} */

/*! @name COMPR1 - DSI Transmit Comparison Register 1 */
/*! @{ */

#define DSPI_MSC_COMPR1_COMP_DATA_MASK           (0xFFFFFFFFU)
#define DSPI_MSC_COMPR1_COMP_DATA_SHIFT          (0U)
#define DSPI_MSC_COMPR1_COMP_DATA_WIDTH          (32U)
#define DSPI_MSC_COMPR1_COMP_DATA(x)             (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_COMPR1_COMP_DATA_SHIFT)) & DSPI_MSC_COMPR1_COMP_DATA_MASK)
/*! @} */

/*! @name DDR1 - DSI Deserialization Data Register 1 */
/*! @{ */

#define DSPI_MSC_DDR1_DESER_DATA_MASK            (0xFFFFFFFFU)
#define DSPI_MSC_DDR1_DESER_DATA_SHIFT           (0U)
#define DSPI_MSC_DDR1_DESER_DATA_WIDTH           (32U)
#define DSPI_MSC_DDR1_DESER_DATA(x)              (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DDR1_DESER_DATA_SHIFT)) & DSPI_MSC_DDR1_DESER_DATA_MASK)
/*! @} */

/*! @name SSR1 - DSI Serialization Source Select Register 1 */
/*! @{ */

#define DSPI_MSC_SSR1_SS_MASK                    (0xFFFFFFFFU)
#define DSPI_MSC_SSR1_SS_SHIFT                   (0U)
#define DSPI_MSC_SSR1_SS_WIDTH                   (32U)
#define DSPI_MSC_SSR1_SS(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SSR1_SS_SHIFT)) & DSPI_MSC_SSR1_SS_MASK)
/*! @} */

/*! @name DIMR1 - DSI Deserialized Data Interrupt Mask Register 1 */
/*! @{ */

#define DSPI_MSC_DIMR1_MASK_MASK                 (0xFFFFFFFFU)
#define DSPI_MSC_DIMR1_MASK_SHIFT                (0U)
#define DSPI_MSC_DIMR1_MASK_WIDTH                (32U)
#define DSPI_MSC_DIMR1_MASK(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DIMR1_MASK_SHIFT)) & DSPI_MSC_DIMR1_MASK_MASK)
/*! @} */

/*! @name DPIR1 - DSI Deserialized Data Polarity Interrupt Register 1 */
/*! @{ */

#define DSPI_MSC_DPIR1_DP_MASK                   (0xFFFFFFFFU)
#define DSPI_MSC_DPIR1_DP_SHIFT                  (0U)
#define DSPI_MSC_DPIR1_DP_WIDTH                  (32U)
#define DSPI_MSC_DPIR1_DP(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_DPIR1_DP_SHIFT)) & DSPI_MSC_DPIR1_DP_MASK)
/*! @} */

/*! @name CTARE - Clock and Transfer Attributes Register Extended */
/*! @{ */

#define DSPI_MSC_CTARE_DTCP_MASK                 (0x7FFU)
#define DSPI_MSC_CTARE_DTCP_SHIFT                (0U)
#define DSPI_MSC_CTARE_DTCP_WIDTH                (11U)
#define DSPI_MSC_CTARE_DTCP(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_CTARE_DTCP_SHIFT)) & DSPI_MSC_CTARE_DTCP_MASK)

#define DSPI_MSC_CTARE_FMSZE_MASK                (0x10000U)
#define DSPI_MSC_CTARE_FMSZE_SHIFT               (16U)
#define DSPI_MSC_CTARE_FMSZE_WIDTH               (1U)
#define DSPI_MSC_CTARE_FMSZE(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_CTARE_FMSZE_SHIFT)) & DSPI_MSC_CTARE_FMSZE_MASK)
/*! @} */

