zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DSPI_MSC.h
/*! @name SREX - Status Register Extended */
/*! @{ */

#define DSPI_MSC_SREX_CMDNXTPTR_MASK             (0xFU)
#define DSPI_MSC_SREX_CMDNXTPTR_SHIFT            (0U)
#define DSPI_MSC_SREX_CMDNXTPTR_WIDTH            (4U)
#define DSPI_MSC_SREX_CMDNXTPTR(x)               (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SREX_CMDNXTPTR_SHIFT)) & DSPI_MSC_SREX_CMDNXTPTR_MASK)

#define DSPI_MSC_SREX_CMDCTR_MASK                (0x1F0U)
#define DSPI_MSC_SREX_CMDCTR_SHIFT               (4U)
#define DSPI_MSC_SREX_CMDCTR_WIDTH               (5U)
#define DSPI_MSC_SREX_CMDCTR(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SREX_CMDCTR_SHIFT)) & DSPI_MSC_SREX_CMDCTR_MASK)

#define DSPI_MSC_SREX_RXCTR4_MASK                (0x800U)
#define DSPI_MSC_SREX_RXCTR4_SHIFT               (11U)
#define DSPI_MSC_SREX_RXCTR4_WIDTH               (1U)
#define DSPI_MSC_SREX_RXCTR4(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SREX_RXCTR4_SHIFT)) & DSPI_MSC_SREX_RXCTR4_MASK)

#define DSPI_MSC_SREX_TXCTR4_MASK                (0x4000U)
#define DSPI_MSC_SREX_TXCTR4_SHIFT               (14U)
#define DSPI_MSC_SREX_TXCTR4_WIDTH               (1U)
#define DSPI_MSC_SREX_TXCTR4(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_SREX_TXCTR4_SHIFT)) & DSPI_MSC_SREX_TXCTR4_MASK)
/*! @} */

/*! @name TSL - Time Slot Length Register */
/*! @{ */

#define DSPI_MSC_TSL_TS0_LEN_MASK                (0x7FU)
#define DSPI_MSC_TSL_TS0_LEN_SHIFT               (0U)
#define DSPI_MSC_TSL_TS0_LEN_WIDTH               (7U)
#define DSPI_MSC_TSL_TS0_LEN(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_TSL_TS0_LEN_SHIFT)) & DSPI_MSC_TSL_TS0_LEN_MASK)

#define DSPI_MSC_TSL_TS1_LEN_MASK                (0x7F00U)
#define DSPI_MSC_TSL_TS1_LEN_SHIFT               (8U)
#define DSPI_MSC_TSL_TS1_LEN_WIDTH               (7U)
#define DSPI_MSC_TSL_TS1_LEN(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_TSL_TS1_LEN_SHIFT)) & DSPI_MSC_TSL_TS1_LEN_MASK)

#define DSPI_MSC_TSL_TS2_LEN_MASK                (0x7F0000U)
#define DSPI_MSC_TSL_TS2_LEN_SHIFT               (16U)
#define DSPI_MSC_TSL_TS2_LEN_WIDTH               (7U)
#define DSPI_MSC_TSL_TS2_LEN(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_TSL_TS2_LEN_SHIFT)) & DSPI_MSC_TSL_TS2_LEN_MASK)

#define DSPI_MSC_TSL_TS3_LEN_MASK                (0x7F000000U)
#define DSPI_MSC_TSL_TS3_LEN_SHIFT               (24U)
#define DSPI_MSC_TSL_TS3_LEN_WIDTH               (7U)
#define DSPI_MSC_TSL_TS3_LEN(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_TSL_TS3_LEN_SHIFT)) & DSPI_MSC_TSL_TS3_LEN_MASK)
/*! @} */

/*! @name TS_CONF - Time Slot Configuration Register */
/*! @{ */

#define DSPI_MSC_TS_CONF_TS0_MASK                (0xFU)
#define DSPI_MSC_TS_CONF_TS0_SHIFT               (0U)
#define DSPI_MSC_TS_CONF_TS0_WIDTH               (4U)
#define DSPI_MSC_TS_CONF_TS0(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_TS_CONF_TS0_SHIFT)) & DSPI_MSC_TS_CONF_TS0_MASK)

#define DSPI_MSC_TS_CONF_TS1_MASK                (0xF0U)
#define DSPI_MSC_TS_CONF_TS1_SHIFT               (4U)
#define DSPI_MSC_TS_CONF_TS1_WIDTH               (4U)
#define DSPI_MSC_TS_CONF_TS1(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_TS_CONF_TS1_SHIFT)) & DSPI_MSC_TS_CONF_TS1_MASK)

#define DSPI_MSC_TS_CONF_TS2_MASK                (0xF00U)
#define DSPI_MSC_TS_CONF_TS2_SHIFT               (8U)
#define DSPI_MSC_TS_CONF_TS2_WIDTH               (4U)
#define DSPI_MSC_TS_CONF_TS2(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_TS_CONF_TS2_SHIFT)) & DSPI_MSC_TS_CONF_TS2_MASK)

#define DSPI_MSC_TS_CONF_TS3_MASK                (0xF000U)
#define DSPI_MSC_TS_CONF_TS3_SHIFT               (12U)
#define DSPI_MSC_TS_CONF_TS3_WIDTH               (4U)
#define DSPI_MSC_TS_CONF_TS3(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_MSC_TS_CONF_TS3_SHIFT)) & DSPI_MSC_TS_CONF_TS3_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group DSPI_MSC_Register_Masks */

/*!
 * @}
 */ /* end of group DSPI_MSC_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K39_DSPI_MSC_H_) */
